###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID linrack12.bioeelocal)
#  Generated on:      Wed Jun 11 00:16:09 2025
#  Design:            TOP
#  Command:           saveDesign postRoute
###############################################################
current_design TOP
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.005  [get_pins {FE_PHC2325_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2325_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2307_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC2307_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2304_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC2304_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2283_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2283_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2274_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2274_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2255_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC2255_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2209_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2209_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2203_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2203_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2105_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2105_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2091_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2091_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2022_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC2022_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1962_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1962_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1941_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1941_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1835_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC1835_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1784_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1784_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1778_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1778_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1606_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC1606_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1605_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1605_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1575_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1575_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1570_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1570_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1355_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1355_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1344_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC1344_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1309_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1309_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1305_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1305_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1220_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1220_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1057_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1057_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1052_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC1052_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1037_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1037_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1036_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1036_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC749_rst/X}]
set_max_fanout 4  [get_pins {FE_PHC749_rst/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC742_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC742_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC741_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC741_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC735_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC735_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC733_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC733_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC730_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC730_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC416_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC416_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC409_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC409_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC407_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC407_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC406_i_CONFIG/X}]
set_max_fanout 4  [get_pins {FE_PHC406_i_CONFIG/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC404_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC404_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC109_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC109_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC29_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC29_RX/X}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {rfin}]
set_max_fanout 4  [get_ports {rfin}]
set_max_capacitance 0.005  [get_ports {rst}]
set_max_fanout 4  [get_ports {rst}]
set_max_capacitance 0.005  [get_ports {MOSI}]
set_max_fanout 4  [get_ports {MOSI}]
set_max_capacitance 0.005  [get_ports {CS}]
set_max_fanout 4  [get_ports {CS}]
set_max_capacitance 0.005  [get_ports {SCK}]
set_max_fanout 4  [get_ports {SCK}]
set_max_capacitance 0.005  [get_ports {TX_BY}]
set_max_fanout 4  [get_ports {TX_BY}]
set_max_capacitance 0.005  [get_ports {RX}]
set_max_fanout 4  [get_ports {RX}]
set_max_capacitance 0.005  [get_ports {i_CONFIG}]
set_max_fanout 4  [get_ports {i_CONFIG}]
set_load -pin_load -max  0.06  [get_ports {osc_freq[3]}]
set_load -pin_load -min  0.06  [get_ports {osc_freq[3]}]
set_load -pin_load -max  0.06  [get_ports {osc_freq[2]}]
set_load -pin_load -min  0.06  [get_ports {osc_freq[2]}]
set_load -pin_load -max  0.06  [get_ports {osc_freq[1]}]
set_load -pin_load -min  0.06  [get_ports {osc_freq[1]}]
set_load -pin_load -max  0.06  [get_ports {osc_freq[0]}]
set_load -pin_load -min  0.06  [get_ports {osc_freq[0]}]
set_load -pin_load -max  0.06  [get_ports {arthur[15]}]
set_load -pin_load -min  0.06  [get_ports {arthur[15]}]
set_load -pin_load -max  0.06  [get_ports {arthur[14]}]
set_load -pin_load -min  0.06  [get_ports {arthur[14]}]
set_load -pin_load -max  0.06  [get_ports {arthur[13]}]
set_load -pin_load -min  0.06  [get_ports {arthur[13]}]
set_load -pin_load -max  0.06  [get_ports {arthur[12]}]
set_load -pin_load -min  0.06  [get_ports {arthur[12]}]
set_load -pin_load -max  0.06  [get_ports {arthur[11]}]
set_load -pin_load -min  0.06  [get_ports {arthur[11]}]
set_load -pin_load -max  0.06  [get_ports {arthur[10]}]
set_load -pin_load -min  0.06  [get_ports {arthur[10]}]
set_load -pin_load -max  0.06  [get_ports {arthur[9]}]
set_load -pin_load -min  0.06  [get_ports {arthur[9]}]
set_load -pin_load -max  0.06  [get_ports {arthur[8]}]
set_load -pin_load -min  0.06  [get_ports {arthur[8]}]
set_load -pin_load -max  0.06  [get_ports {arthur[7]}]
set_load -pin_load -min  0.06  [get_ports {arthur[7]}]
set_load -pin_load -max  0.06  [get_ports {arthur[6]}]
set_load -pin_load -min  0.06  [get_ports {arthur[6]}]
set_load -pin_load -max  0.06  [get_ports {arthur[5]}]
set_load -pin_load -min  0.06  [get_ports {arthur[5]}]
set_load -pin_load -max  0.06  [get_ports {arthur[4]}]
set_load -pin_load -min  0.06  [get_ports {arthur[4]}]
set_load -pin_load -max  0.06  [get_ports {arthur[3]}]
set_load -pin_load -min  0.06  [get_ports {arthur[3]}]
set_load -pin_load -max  0.06  [get_ports {arthur[2]}]
set_load -pin_load -min  0.06  [get_ports {arthur[2]}]
set_load -pin_load -max  0.06  [get_ports {arthur[1]}]
set_load -pin_load -min  0.06  [get_ports {arthur[1]}]
set_load -pin_load -max  0.06  [get_ports {arthur[0]}]
set_load -pin_load -min  0.06  [get_ports {arthur[0]}]
set_load -pin_load -max  1  [get_ports {pkt_rec}]
set_load -pin_load -min  1  [get_ports {pkt_rec}]
set_load -pin_load -max  1  [get_ports {MISO}]
set_load -pin_load -min  1  [get_ports {MISO}]
set_load -pin_load -max  0.06  [get_ports {TX_OUT}]
set_load -pin_load -min  0.06  [get_ports {TX_OUT}]
set_load -pin_load -max  1  [get_ports {sh_en}]
set_load -pin_load -min  1  [get_ports {sh_en}]
set_max_fanout 4  [get_designs {TOP}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {SCK}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {RX}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_BY}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {CS}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {i_CONFIG}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rfin}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MOSI}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[3]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[4]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[1]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[2]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[0]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[15]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[13]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[9]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MISO}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[11]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[7]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[5]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[2]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[3]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[0]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[1]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_OUT}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[14]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {pkt_rec}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[12]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[8]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[10]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[6]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sh_en}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
