###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID bioeebeanie.bioeelocal)
#  Generated on:      Wed May 28 16:30:52 2025
#  Design:            TOP
#  Command:           saveDesign TOPv3
###############################################################
current_design TOP
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.005  [get_pins {FE_PHC2240_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2240_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2125_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2125_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2120_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2120_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2100_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2100_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2098_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2098_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2096_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2096_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2058_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2058_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2055_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2055_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2054_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2054_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1990_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1990_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1986_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1986_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1984_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1984_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1927_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1927_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1884_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1884_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1878_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1878_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1873_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1873_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1814_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1814_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1767_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1767_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1760_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1760_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1756_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1756_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1749_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1749_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1578_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1578_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1567_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1567_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1564_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1564_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1547_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1547_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1375_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1375_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1371_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1371_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1368_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1368_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1299_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1299_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1143_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1143_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1139_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1139_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1137_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1137_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC892_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC892_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC884_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC884_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC881_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC881_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC880_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC880_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC634_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC634_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC633_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC633_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC630_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC630_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC629_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC629_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC368_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC368_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC363_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC363_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC361_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC361_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC313_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC313_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC88_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC88_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC87_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC87_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC22_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC22_RX/X}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {rfin}]
set_max_fanout 4  [get_ports {rfin}]
set_max_capacitance 0.005  [get_ports {rst}]
set_max_fanout 4  [get_ports {rst}]
set_max_capacitance 0.005  [get_ports {MOSI}]
set_max_fanout 4  [get_ports {MOSI}]
set_max_capacitance 0.005  [get_ports {CS}]
set_max_fanout 4  [get_ports {CS}]
set_max_capacitance 0.005  [get_ports {SCK}]
set_max_fanout 4  [get_ports {SCK}]
set_max_capacitance 0.005  [get_ports {TX_BY}]
set_max_fanout 4  [get_ports {TX_BY}]
set_max_capacitance 0.005  [get_ports {RX}]
set_max_fanout 4  [get_ports {RX}]
set_load -pin_load -max  0.004  [get_ports {pkt_rec}]
set_load -pin_load -min  0.004  [get_ports {pkt_rec}]
set_load -pin_load -max  0.004  [get_ports {MISO}]
set_load -pin_load -min  0.004  [get_ports {MISO}]
set_load -pin_load -max  0.004  [get_ports {TX_OUT}]
set_load -pin_load -min  0.004  [get_ports {TX_OUT}]
set_load -pin_load -max  0.004  [get_ports {sh_en}]
set_load -pin_load -min  0.004  [get_ports {sh_en}]
set_max_fanout 4  [get_designs {TOP}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {SCK}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {RX}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_BY}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {CS}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rfin}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MOSI}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MISO}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_OUT}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {pkt_rec}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sh_en}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
