###################################################################

# Created by write_sdc on Fri May 30 22:43:50 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_load -pin_load 0.004 [get_ports sh_en]
set_load -pin_load 0.004 [get_ports fsm_rst]
set_load -pin_load 0.004 [get_ports sh_en_done]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports rfin]
set_max_capacitance 0.005 [get_ports RX]
set_max_capacitance 0.005 [get_ports tx_rdy]
set_max_capacitance 0.005 [get_ports ext_counter_flag_RX]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[13]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[12]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[11]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[10]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[9]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[8]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[7]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[6]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[5]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[4]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[3]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[2]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[1]}]
set_max_capacitance 0.005 [get_ports {ext_counter_RX[0]}]
set_max_capacitance 0.005 [get_ports ext_counter_flag_TX]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[13]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[12]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[11]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[10]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[9]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[8]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[7]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[6]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[5]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[4]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[3]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[2]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[1]}]
set_max_capacitance 0.005 [get_ports {ext_counter_TX[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports rfin]
set_max_fanout 4 [get_ports RX]
set_max_fanout 4 [get_ports tx_rdy]
set_max_fanout 4 [get_ports ext_counter_flag_RX]
set_max_fanout 4 [get_ports {ext_counter_RX[13]}]
set_max_fanout 4 [get_ports {ext_counter_RX[12]}]
set_max_fanout 4 [get_ports {ext_counter_RX[11]}]
set_max_fanout 4 [get_ports {ext_counter_RX[10]}]
set_max_fanout 4 [get_ports {ext_counter_RX[9]}]
set_max_fanout 4 [get_ports {ext_counter_RX[8]}]
set_max_fanout 4 [get_ports {ext_counter_RX[7]}]
set_max_fanout 4 [get_ports {ext_counter_RX[6]}]
set_max_fanout 4 [get_ports {ext_counter_RX[5]}]
set_max_fanout 4 [get_ports {ext_counter_RX[4]}]
set_max_fanout 4 [get_ports {ext_counter_RX[3]}]
set_max_fanout 4 [get_ports {ext_counter_RX[2]}]
set_max_fanout 4 [get_ports {ext_counter_RX[1]}]
set_max_fanout 4 [get_ports {ext_counter_RX[0]}]
set_max_fanout 4 [get_ports ext_counter_flag_TX]
set_max_fanout 4 [get_ports {ext_counter_TX[13]}]
set_max_fanout 4 [get_ports {ext_counter_TX[12]}]
set_max_fanout 4 [get_ports {ext_counter_TX[11]}]
set_max_fanout 4 [get_ports {ext_counter_TX[10]}]
set_max_fanout 4 [get_ports {ext_counter_TX[9]}]
set_max_fanout 4 [get_ports {ext_counter_TX[8]}]
set_max_fanout 4 [get_ports {ext_counter_TX[7]}]
set_max_fanout 4 [get_ports {ext_counter_TX[6]}]
set_max_fanout 4 [get_ports {ext_counter_TX[5]}]
set_max_fanout 4 [get_ports {ext_counter_TX[4]}]
set_max_fanout 4 [get_ports {ext_counter_TX[3]}]
set_max_fanout 4 [get_ports {ext_counter_TX[2]}]
set_max_fanout 4 [get_ports {ext_counter_TX[1]}]
set_max_fanout 4 [get_ports {ext_counter_TX[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports rst]
set_input_delay -clock clk  0.02  [get_ports rfin]
set_input_delay -clock clk  0.02  [get_ports RX]
set_input_delay -clock clk  0.02  [get_ports tx_rdy]
set_input_delay -clock clk  0.02  [get_ports ext_counter_flag_RX]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[13]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[12]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[11]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[10]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[9]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[8]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[7]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[6]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[5]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[4]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[3]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[2]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[1]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_RX[0]}]
set_input_delay -clock clk  0.02  [get_ports ext_counter_flag_TX]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[13]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[12]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[11]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[10]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[9]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[8]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[7]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[6]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[5]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[4]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[3]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[2]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[1]}]
set_input_delay -clock clk  0.02  [get_ports {ext_counter_TX[0]}]
set_output_delay -clock clk  0.02  [get_ports sh_en]
set_output_delay -clock clk  0.02  [get_ports fsm_rst]
set_output_delay -clock clk  0.02  [get_ports sh_en_done]
