###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID linrack12.bioeelocal)
#  Generated on:      Sat May 31 14:39:03 2025
#  Design:            adder
#  Command:           saveDesign adder
###############################################################
current_design adder
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_max_capacitance 0.005  [get_pins {FE_PHC13_b_0/X}]
set_max_fanout 4  [get_pins {FE_PHC13_b_0/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC12_a_0/X}]
set_max_fanout 4  [get_pins {FE_PHC12_a_0/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2_b_0/X}]
set_max_fanout 4  [get_pins {FE_PHC2_b_0/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1_a_0/X}]
set_max_fanout 4  [get_pins {FE_PHC1_a_0/X}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {a[8]}]
set_max_fanout 4  [get_ports {a[8]}]
set_max_capacitance 0.005  [get_ports {a[7]}]
set_max_fanout 4  [get_ports {a[7]}]
set_max_capacitance 0.005  [get_ports {a[6]}]
set_max_fanout 4  [get_ports {a[6]}]
set_max_capacitance 0.005  [get_ports {a[5]}]
set_max_fanout 4  [get_ports {a[5]}]
set_max_capacitance 0.005  [get_ports {a[4]}]
set_max_fanout 4  [get_ports {a[4]}]
set_max_capacitance 0.005  [get_ports {a[3]}]
set_max_fanout 4  [get_ports {a[3]}]
set_max_capacitance 0.005  [get_ports {a[2]}]
set_max_fanout 4  [get_ports {a[2]}]
set_max_capacitance 0.005  [get_ports {a[1]}]
set_max_fanout 4  [get_ports {a[1]}]
set_max_capacitance 0.005  [get_ports {a[0]}]
set_max_fanout 4  [get_ports {a[0]}]
set_max_capacitance 0.005  [get_ports {b[8]}]
set_max_fanout 4  [get_ports {b[8]}]
set_max_capacitance 0.005  [get_ports {b[7]}]
set_max_fanout 4  [get_ports {b[7]}]
set_max_capacitance 0.005  [get_ports {b[6]}]
set_max_fanout 4  [get_ports {b[6]}]
set_max_capacitance 0.005  [get_ports {b[5]}]
set_max_fanout 4  [get_ports {b[5]}]
set_max_capacitance 0.005  [get_ports {b[4]}]
set_max_fanout 4  [get_ports {b[4]}]
set_max_capacitance 0.005  [get_ports {b[3]}]
set_max_fanout 4  [get_ports {b[3]}]
set_max_capacitance 0.005  [get_ports {b[2]}]
set_max_fanout 4  [get_ports {b[2]}]
set_max_capacitance 0.005  [get_ports {b[1]}]
set_max_fanout 4  [get_ports {b[1]}]
set_max_capacitance 0.005  [get_ports {b[0]}]
set_max_fanout 4  [get_ports {b[0]}]
set_load -pin_load -max  0.004  [get_ports {sum[8]}]
set_load -pin_load -min  0.004  [get_ports {sum[8]}]
set_load -pin_load -max  0.004  [get_ports {sum[7]}]
set_load -pin_load -min  0.004  [get_ports {sum[7]}]
set_load -pin_load -max  0.004  [get_ports {sum[6]}]
set_load -pin_load -min  0.004  [get_ports {sum[6]}]
set_load -pin_load -max  0.004  [get_ports {sum[5]}]
set_load -pin_load -min  0.004  [get_ports {sum[5]}]
set_load -pin_load -max  0.004  [get_ports {sum[4]}]
set_load -pin_load -min  0.004  [get_ports {sum[4]}]
set_load -pin_load -max  0.004  [get_ports {sum[3]}]
set_load -pin_load -min  0.004  [get_ports {sum[3]}]
set_load -pin_load -max  0.004  [get_ports {sum[2]}]
set_load -pin_load -min  0.004  [get_ports {sum[2]}]
set_load -pin_load -max  0.004  [get_ports {sum[1]}]
set_load -pin_load -min  0.004  [get_ports {sum[1]}]
set_load -pin_load -max  0.004  [get_ports {sum[0]}]
set_load -pin_load -min  0.004  [get_ports {sum[0]}]
set_load -pin_load -max  0.004  [get_ports {carry}]
set_load -pin_load -min  0.004  [get_ports {carry}]
set_max_fanout 4  [get_designs {adder}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[8]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[8]}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {b[6]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[7]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[5]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[3]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[1]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {carry}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[8]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[6]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[4]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[2]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sum[0]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
