###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID linrack12.bioeelocal)
#  Generated on:      Sat May 31 13:18:13 2025
#  Design:            TOP
#  Command:           saveDesign TOPv6
###############################################################
current_design TOP
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.005  [get_pins {FE_PHC2319_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2319_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2313_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2313_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2293_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2293_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2291_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2291_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2288_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2288_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2243_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2243_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2235_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2235_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2233_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2233_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2138_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2138_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2137_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2137_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2010_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC2010_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2006_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2006_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1838_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1838_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1833_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1833_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1831_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1831_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1650_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1650_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1648_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1648_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1644_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1644_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1436_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1436_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1431_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1431_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1428_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1428_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1349_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1349_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1190_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1190_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1174_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1174_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1169_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1169_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1167_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1167_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1078_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1078_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC913_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC913_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC912_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC912_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC909_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC909_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC820_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC820_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC652_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC652_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC648_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC648_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC645_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC645_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC592_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC592_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC383_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC383_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC363_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC363_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC360_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC360_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC311_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC311_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC117_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC117_MOSI/X}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {rfin}]
set_max_fanout 4  [get_ports {rfin}]
set_max_capacitance 0.005  [get_ports {rst}]
set_max_fanout 4  [get_ports {rst}]
set_max_capacitance 0.005  [get_ports {MOSI}]
set_max_fanout 4  [get_ports {MOSI}]
set_max_capacitance 0.005  [get_ports {CS}]
set_max_fanout 4  [get_ports {CS}]
set_max_capacitance 0.005  [get_ports {SCK}]
set_max_fanout 4  [get_ports {SCK}]
set_max_capacitance 0.005  [get_ports {TX_BY}]
set_max_fanout 4  [get_ports {TX_BY}]
set_max_capacitance 0.005  [get_ports {RX}]
set_max_fanout 4  [get_ports {RX}]
set_load -pin_load -max  0.004  [get_ports {pkt_rec}]
set_load -pin_load -min  0.004  [get_ports {pkt_rec}]
set_load -pin_load -max  0.004  [get_ports {MISO}]
set_load -pin_load -min  0.004  [get_ports {MISO}]
set_load -pin_load -max  0.004  [get_ports {TX_OUT}]
set_load -pin_load -min  0.004  [get_ports {TX_OUT}]
set_load -pin_load -max  0.004  [get_ports {sh_en}]
set_load -pin_load -min  0.004  [get_ports {sh_en}]
set_max_fanout 4  [get_designs {TOP}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {SCK}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {RX}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_BY}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {CS}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rfin}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MOSI}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MISO}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_OUT}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {pkt_rec}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sh_en}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
