###################################################################

# Created by write_sdc on Fri Apr 18 13:10:47 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_load -pin_load 0.004 [get_ports {OUT[7]}]
set_load -pin_load 0.004 [get_ports {OUT[6]}]
set_load -pin_load 0.004 [get_ports {OUT[5]}]
set_load -pin_load 0.004 [get_ports {OUT[4]}]
set_load -pin_load 0.004 [get_ports {OUT[3]}]
set_load -pin_load 0.004 [get_ports {OUT[2]}]
set_load -pin_load 0.004 [get_ports {OUT[1]}]
set_load -pin_load 0.004 [get_ports {OUT[0]}]
set_load -pin_load 0.004 [get_ports MISO]
set_load -pin_load 0.004 [get_ports SPI_OUT_RDY]
set_load -pin_load 0.004 [get_ports CS_sync]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports MOSI]
set_max_capacitance 0.005 [get_ports SCK]
set_max_capacitance 0.005 [get_ports SS]
set_max_capacitance 0.005 [get_ports {DATA[7]}]
set_max_capacitance 0.005 [get_ports {DATA[6]}]
set_max_capacitance 0.005 [get_ports {DATA[5]}]
set_max_capacitance 0.005 [get_ports {DATA[4]}]
set_max_capacitance 0.005 [get_ports {DATA[3]}]
set_max_capacitance 0.005 [get_ports {DATA[2]}]
set_max_capacitance 0.005 [get_ports {DATA[1]}]
set_max_capacitance 0.005 [get_ports {DATA[0]}]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports MOSI]
set_max_fanout 4 [get_ports SCK]
set_max_fanout 4 [get_ports SS]
set_max_fanout 4 [get_ports {DATA[7]}]
set_max_fanout 4 [get_ports {DATA[6]}]
set_max_fanout 4 [get_ports {DATA[5]}]
set_max_fanout 4 [get_ports {DATA[4]}]
set_max_fanout 4 [get_ports {DATA[3]}]
set_max_fanout 4 [get_ports {DATA[2]}]
set_max_fanout 4 [get_ports {DATA[1]}]
set_max_fanout 4 [get_ports {DATA[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports rst]
set_input_delay -clock clk  0.02  [get_ports MOSI]
set_input_delay -clock clk  0.02  [get_ports SCK]
set_input_delay -clock clk  0.02  [get_ports SS]
set_input_delay -clock clk  0.02  [get_ports {DATA[7]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[6]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[5]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[4]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[3]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[2]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[1]}]
set_input_delay -clock clk  0.02  [get_ports {DATA[0]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[7]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[6]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[5]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[4]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[3]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[2]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[1]}]
set_output_delay -clock clk  0.02  [get_ports {OUT[0]}]
set_output_delay -clock clk  0.02  [get_ports MISO]
set_output_delay -clock clk  0.02  [get_ports SPI_OUT_RDY]
set_output_delay -clock clk  0.02  [get_ports CS_sync]
