###################################################################

# Created by write_sdc on Sat May 31 13:31:18 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_load -pin_load 0.004 [get_ports {sum[8]}]
set_load -pin_load 0.004 [get_ports {sum[7]}]
set_load -pin_load 0.004 [get_ports {sum[6]}]
set_load -pin_load 0.004 [get_ports {sum[5]}]
set_load -pin_load 0.004 [get_ports {sum[4]}]
set_load -pin_load 0.004 [get_ports {sum[3]}]
set_load -pin_load 0.004 [get_ports {sum[2]}]
set_load -pin_load 0.004 [get_ports {sum[1]}]
set_load -pin_load 0.004 [get_ports {sum[0]}]
set_load -pin_load 0.004 [get_ports carry]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports {a[8]}]
set_max_capacitance 0.005 [get_ports {a[7]}]
set_max_capacitance 0.005 [get_ports {a[6]}]
set_max_capacitance 0.005 [get_ports {a[5]}]
set_max_capacitance 0.005 [get_ports {a[4]}]
set_max_capacitance 0.005 [get_ports {a[3]}]
set_max_capacitance 0.005 [get_ports {a[2]}]
set_max_capacitance 0.005 [get_ports {a[1]}]
set_max_capacitance 0.005 [get_ports {a[0]}]
set_max_capacitance 0.005 [get_ports {b[8]}]
set_max_capacitance 0.005 [get_ports {b[7]}]
set_max_capacitance 0.005 [get_ports {b[6]}]
set_max_capacitance 0.005 [get_ports {b[5]}]
set_max_capacitance 0.005 [get_ports {b[4]}]
set_max_capacitance 0.005 [get_ports {b[3]}]
set_max_capacitance 0.005 [get_ports {b[2]}]
set_max_capacitance 0.005 [get_ports {b[1]}]
set_max_capacitance 0.005 [get_ports {b[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports {a[8]}]
set_max_fanout 4 [get_ports {a[7]}]
set_max_fanout 4 [get_ports {a[6]}]
set_max_fanout 4 [get_ports {a[5]}]
set_max_fanout 4 [get_ports {a[4]}]
set_max_fanout 4 [get_ports {a[3]}]
set_max_fanout 4 [get_ports {a[2]}]
set_max_fanout 4 [get_ports {a[1]}]
set_max_fanout 4 [get_ports {a[0]}]
set_max_fanout 4 [get_ports {b[8]}]
set_max_fanout 4 [get_ports {b[7]}]
set_max_fanout 4 [get_ports {b[6]}]
set_max_fanout 4 [get_ports {b[5]}]
set_max_fanout 4 [get_ports {b[4]}]
set_max_fanout 4 [get_ports {b[3]}]
set_max_fanout 4 [get_ports {b[2]}]
set_max_fanout 4 [get_ports {b[1]}]
set_max_fanout 4 [get_ports {b[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports {a[8]}]
set_input_delay -clock clk  0.02  [get_ports {a[7]}]
set_input_delay -clock clk  0.02  [get_ports {a[6]}]
set_input_delay -clock clk  0.02  [get_ports {a[5]}]
set_input_delay -clock clk  0.02  [get_ports {a[4]}]
set_input_delay -clock clk  0.02  [get_ports {a[3]}]
set_input_delay -clock clk  0.02  [get_ports {a[2]}]
set_input_delay -clock clk  0.02  [get_ports {a[1]}]
set_input_delay -clock clk  0.02  [get_ports {a[0]}]
set_input_delay -clock clk  0.02  [get_ports {b[8]}]
set_input_delay -clock clk  0.02  [get_ports {b[7]}]
set_input_delay -clock clk  0.02  [get_ports {b[6]}]
set_input_delay -clock clk  0.02  [get_ports {b[5]}]
set_input_delay -clock clk  0.02  [get_ports {b[4]}]
set_input_delay -clock clk  0.02  [get_ports {b[3]}]
set_input_delay -clock clk  0.02  [get_ports {b[2]}]
set_input_delay -clock clk  0.02  [get_ports {b[1]}]
set_input_delay -clock clk  0.02  [get_ports {b[0]}]
set_output_delay -clock clk  0.02  [get_ports {sum[8]}]
set_output_delay -clock clk  0.02  [get_ports {sum[7]}]
set_output_delay -clock clk  0.02  [get_ports {sum[6]}]
set_output_delay -clock clk  0.02  [get_ports {sum[5]}]
set_output_delay -clock clk  0.02  [get_ports {sum[4]}]
set_output_delay -clock clk  0.02  [get_ports {sum[3]}]
set_output_delay -clock clk  0.02  [get_ports {sum[2]}]
set_output_delay -clock clk  0.02  [get_ports {sum[1]}]
set_output_delay -clock clk  0.02  [get_ports {sum[0]}]
set_output_delay -clock clk  0.02  [get_ports carry]
