###################################################################

# Created by write_sdc on Fri Jun 6 13:01:24 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[15]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[14]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[13]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[12]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[11]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[10]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[9]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[8]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[7]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[6]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[5]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[4]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[3]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[2]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[1]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_RX[0]}]
set_load -pin_load 0.004 [get_ports ext_counter_flag_RX]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[15]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[14]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[13]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[12]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[11]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[10]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[9]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[8]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[7]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[6]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[5]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[4]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[3]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[2]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[1]}]
set_load -pin_load 0.004 [get_ports {ext_counter_value_TX[0]}]
set_load -pin_load 0.004 [get_ports ext_counter_flag_TX]
set_load -pin_load 0.004 [get_ports {osc_freq[3]}]
set_load -pin_load 0.004 [get_ports {osc_freq[2]}]
set_load -pin_load 0.004 [get_ports {osc_freq[1]}]
set_load -pin_load 0.004 [get_ports {osc_freq[0]}]
set_load -pin_load 0.004 [get_ports {arthur[7]}]
set_load -pin_load 0.004 [get_ports {arthur[6]}]
set_load -pin_load 0.004 [get_ports {arthur[5]}]
set_load -pin_load 0.004 [get_ports {arthur[4]}]
set_load -pin_load 0.004 [get_ports {arthur[3]}]
set_load -pin_load 0.004 [get_ports {arthur[2]}]
set_load -pin_load 0.004 [get_ports {arthur[1]}]
set_load -pin_load 0.004 [get_ports {arthur[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports i_CONFIG]
set_max_capacitance 0.005 [get_ports {spi_rx_data[7]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[6]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[5]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[4]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[3]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[2]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[1]}]
set_max_capacitance 0.005 [get_ports {spi_rx_data[0]}]
set_max_capacitance 0.005 [get_ports spi_rx_valid]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports i_CONFIG]
set_max_fanout 4 [get_ports {spi_rx_data[7]}]
set_max_fanout 4 [get_ports {spi_rx_data[6]}]
set_max_fanout 4 [get_ports {spi_rx_data[5]}]
set_max_fanout 4 [get_ports {spi_rx_data[4]}]
set_max_fanout 4 [get_ports {spi_rx_data[3]}]
set_max_fanout 4 [get_ports {spi_rx_data[2]}]
set_max_fanout 4 [get_ports {spi_rx_data[1]}]
set_max_fanout 4 [get_ports {spi_rx_data[0]}]
set_max_fanout 4 [get_ports spi_rx_valid]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports rst]
set_input_delay -clock clk  0.02  [get_ports i_CONFIG]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[7]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[6]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[5]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[4]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[3]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[2]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[1]}]
set_input_delay -clock clk  0.02  [get_ports {spi_rx_data[0]}]
set_input_delay -clock clk  0.02  [get_ports spi_rx_valid]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[15]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[14]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[13]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[12]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[11]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[10]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[9]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[8]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[7]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[6]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[5]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[4]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[3]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[2]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[1]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_RX[0]}]
set_output_delay -clock clk  0.02  [get_ports ext_counter_flag_RX]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[15]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[14]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[13]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[12]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[11]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[10]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[9]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[8]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[7]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[6]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[5]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[4]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[3]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[2]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[1]}]
set_output_delay -clock clk  0.02  [get_ports {ext_counter_value_TX[0]}]
set_output_delay -clock clk  0.02  [get_ports ext_counter_flag_TX]
set_output_delay -clock clk  0.02  [get_ports {osc_freq[3]}]
set_output_delay -clock clk  0.02  [get_ports {osc_freq[2]}]
set_output_delay -clock clk  0.02  [get_ports {osc_freq[1]}]
set_output_delay -clock clk  0.02  [get_ports {osc_freq[0]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[7]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[6]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[5]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[4]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[3]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[2]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[1]}]
set_output_delay -clock clk  0.02  [get_ports {arthur[0]}]
