###################################################################

# Created by write_sdc on Mon Mar 31 14:28:44 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_load -pin_load 0.004 [get_ports {dout[63]}]
set_load -pin_load 0.004 [get_ports {dout[62]}]
set_load -pin_load 0.004 [get_ports {dout[61]}]
set_load -pin_load 0.004 [get_ports {dout[60]}]
set_load -pin_load 0.004 [get_ports {dout[59]}]
set_load -pin_load 0.004 [get_ports {dout[58]}]
set_load -pin_load 0.004 [get_ports {dout[57]}]
set_load -pin_load 0.004 [get_ports {dout[56]}]
set_load -pin_load 0.004 [get_ports {dout[55]}]
set_load -pin_load 0.004 [get_ports {dout[54]}]
set_load -pin_load 0.004 [get_ports {dout[53]}]
set_load -pin_load 0.004 [get_ports {dout[52]}]
set_load -pin_load 0.004 [get_ports {dout[51]}]
set_load -pin_load 0.004 [get_ports {dout[50]}]
set_load -pin_load 0.004 [get_ports {dout[49]}]
set_load -pin_load 0.004 [get_ports {dout[48]}]
set_load -pin_load 0.004 [get_ports {dout[47]}]
set_load -pin_load 0.004 [get_ports {dout[46]}]
set_load -pin_load 0.004 [get_ports {dout[45]}]
set_load -pin_load 0.004 [get_ports {dout[44]}]
set_load -pin_load 0.004 [get_ports {dout[43]}]
set_load -pin_load 0.004 [get_ports {dout[42]}]
set_load -pin_load 0.004 [get_ports {dout[41]}]
set_load -pin_load 0.004 [get_ports {dout[40]}]
set_load -pin_load 0.004 [get_ports {dout[39]}]
set_load -pin_load 0.004 [get_ports {dout[38]}]
set_load -pin_load 0.004 [get_ports {dout[37]}]
set_load -pin_load 0.004 [get_ports {dout[36]}]
set_load -pin_load 0.004 [get_ports {dout[35]}]
set_load -pin_load 0.004 [get_ports {dout[34]}]
set_load -pin_load 0.004 [get_ports {dout[33]}]
set_load -pin_load 0.004 [get_ports {dout[32]}]
set_load -pin_load 0.004 [get_ports {dout[31]}]
set_load -pin_load 0.004 [get_ports {dout[30]}]
set_load -pin_load 0.004 [get_ports {dout[29]}]
set_load -pin_load 0.004 [get_ports {dout[28]}]
set_load -pin_load 0.004 [get_ports {dout[27]}]
set_load -pin_load 0.004 [get_ports {dout[26]}]
set_load -pin_load 0.004 [get_ports {dout[25]}]
set_load -pin_load 0.004 [get_ports {dout[24]}]
set_load -pin_load 0.004 [get_ports {dout[23]}]
set_load -pin_load 0.004 [get_ports {dout[22]}]
set_load -pin_load 0.004 [get_ports {dout[21]}]
set_load -pin_load 0.004 [get_ports {dout[20]}]
set_load -pin_load 0.004 [get_ports {dout[19]}]
set_load -pin_load 0.004 [get_ports {dout[18]}]
set_load -pin_load 0.004 [get_ports {dout[17]}]
set_load -pin_load 0.004 [get_ports {dout[16]}]
set_load -pin_load 0.004 [get_ports {dout[15]}]
set_load -pin_load 0.004 [get_ports {dout[14]}]
set_load -pin_load 0.004 [get_ports {dout[13]}]
set_load -pin_load 0.004 [get_ports {dout[12]}]
set_load -pin_load 0.004 [get_ports {dout[11]}]
set_load -pin_load 0.004 [get_ports {dout[10]}]
set_load -pin_load 0.004 [get_ports {dout[9]}]
set_load -pin_load 0.004 [get_ports {dout[8]}]
set_load -pin_load 0.004 [get_ports {dout[7]}]
set_load -pin_load 0.004 [get_ports {dout[6]}]
set_load -pin_load 0.004 [get_ports {dout[5]}]
set_load -pin_load 0.004 [get_ports {dout[4]}]
set_load -pin_load 0.004 [get_ports {dout[3]}]
set_load -pin_load 0.004 [get_ports {dout[2]}]
set_load -pin_load 0.004 [get_ports {dout[1]}]
set_load -pin_load 0.004 [get_ports {dout[0]}]
set_load -pin_load 0.004 [get_ports pkt_rec]
set_max_capacitance 0.005 [get_ports din]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports en]
set_max_capacitance 0.005 [get_ports pkt_rst]
set_max_fanout 4 [get_ports din]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports en]
set_max_fanout 4 [get_ports pkt_rst]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.06 [get_clocks clk]
set_clock_transition -max -fall 0.06 [get_clocks clk]
set_clock_transition -min -rise 0.06 [get_clocks clk]
set_clock_transition -min -fall 0.06 [get_clocks clk]
set_input_delay -clock clk  0.02  [get_ports din]
set_input_delay -clock clk  0.02  [get_ports rst]
set_input_delay -clock clk  0.02  [get_ports en]
set_input_delay -clock clk  0.02  [get_ports pkt_rst]
set_output_delay -clock clk  0.02  [get_ports {dout[63]}]
set_output_delay -clock clk  0.02  [get_ports {dout[62]}]
set_output_delay -clock clk  0.02  [get_ports {dout[61]}]
set_output_delay -clock clk  0.02  [get_ports {dout[60]}]
set_output_delay -clock clk  0.02  [get_ports {dout[59]}]
set_output_delay -clock clk  0.02  [get_ports {dout[58]}]
set_output_delay -clock clk  0.02  [get_ports {dout[57]}]
set_output_delay -clock clk  0.02  [get_ports {dout[56]}]
set_output_delay -clock clk  0.02  [get_ports {dout[55]}]
set_output_delay -clock clk  0.02  [get_ports {dout[54]}]
set_output_delay -clock clk  0.02  [get_ports {dout[53]}]
set_output_delay -clock clk  0.02  [get_ports {dout[52]}]
set_output_delay -clock clk  0.02  [get_ports {dout[51]}]
set_output_delay -clock clk  0.02  [get_ports {dout[50]}]
set_output_delay -clock clk  0.02  [get_ports {dout[49]}]
set_output_delay -clock clk  0.02  [get_ports {dout[48]}]
set_output_delay -clock clk  0.02  [get_ports {dout[47]}]
set_output_delay -clock clk  0.02  [get_ports {dout[46]}]
set_output_delay -clock clk  0.02  [get_ports {dout[45]}]
set_output_delay -clock clk  0.02  [get_ports {dout[44]}]
set_output_delay -clock clk  0.02  [get_ports {dout[43]}]
set_output_delay -clock clk  0.02  [get_ports {dout[42]}]
set_output_delay -clock clk  0.02  [get_ports {dout[41]}]
set_output_delay -clock clk  0.02  [get_ports {dout[40]}]
set_output_delay -clock clk  0.02  [get_ports {dout[39]}]
set_output_delay -clock clk  0.02  [get_ports {dout[38]}]
set_output_delay -clock clk  0.02  [get_ports {dout[37]}]
set_output_delay -clock clk  0.02  [get_ports {dout[36]}]
set_output_delay -clock clk  0.02  [get_ports {dout[35]}]
set_output_delay -clock clk  0.02  [get_ports {dout[34]}]
set_output_delay -clock clk  0.02  [get_ports {dout[33]}]
set_output_delay -clock clk  0.02  [get_ports {dout[32]}]
set_output_delay -clock clk  0.02  [get_ports {dout[31]}]
set_output_delay -clock clk  0.02  [get_ports {dout[30]}]
set_output_delay -clock clk  0.02  [get_ports {dout[29]}]
set_output_delay -clock clk  0.02  [get_ports {dout[28]}]
set_output_delay -clock clk  0.02  [get_ports {dout[27]}]
set_output_delay -clock clk  0.02  [get_ports {dout[26]}]
set_output_delay -clock clk  0.02  [get_ports {dout[25]}]
set_output_delay -clock clk  0.02  [get_ports {dout[24]}]
set_output_delay -clock clk  0.02  [get_ports {dout[23]}]
set_output_delay -clock clk  0.02  [get_ports {dout[22]}]
set_output_delay -clock clk  0.02  [get_ports {dout[21]}]
set_output_delay -clock clk  0.02  [get_ports {dout[20]}]
set_output_delay -clock clk  0.02  [get_ports {dout[19]}]
set_output_delay -clock clk  0.02  [get_ports {dout[18]}]
set_output_delay -clock clk  0.02  [get_ports {dout[17]}]
set_output_delay -clock clk  0.02  [get_ports {dout[16]}]
set_output_delay -clock clk  0.02  [get_ports {dout[15]}]
set_output_delay -clock clk  0.02  [get_ports {dout[14]}]
set_output_delay -clock clk  0.02  [get_ports {dout[13]}]
set_output_delay -clock clk  0.02  [get_ports {dout[12]}]
set_output_delay -clock clk  0.02  [get_ports {dout[11]}]
set_output_delay -clock clk  0.02  [get_ports {dout[10]}]
set_output_delay -clock clk  0.02  [get_ports {dout[9]}]
set_output_delay -clock clk  0.02  [get_ports {dout[8]}]
set_output_delay -clock clk  0.02  [get_ports {dout[7]}]
set_output_delay -clock clk  0.02  [get_ports {dout[6]}]
set_output_delay -clock clk  0.02  [get_ports {dout[5]}]
set_output_delay -clock clk  0.02  [get_ports {dout[4]}]
set_output_delay -clock clk  0.02  [get_ports {dout[3]}]
set_output_delay -clock clk  0.02  [get_ports {dout[2]}]
set_output_delay -clock clk  0.02  [get_ports {dout[1]}]
set_output_delay -clock clk  0.02  [get_ports {dout[0]}]
set_output_delay -clock clk  0.02  [get_ports pkt_rec]
