###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID bioeebeanie.bioeelocal)
#  Generated on:      Thu May 29 16:04:25 2025
#  Design:            TOP
#  Command:           saveDesign TOPv5
###############################################################
current_design TOP
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.005  [get_pins {FE_PHC2077_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC2077_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC2016_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC2016_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1875_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1875_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1873_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1873_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1872_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1872_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1863_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1863_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1855_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1855_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1851_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1851_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1850_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1850_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1827_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1827_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1822_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1822_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1817_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1817_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1765_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1765_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1749_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1749_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1665_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1665_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1657_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1657_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1656_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1656_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1593_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1593_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1560_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1560_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1549_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1549_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1548_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1548_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1423_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1423_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1421_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1421_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1418_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1418_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1417_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1417_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1253_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1253_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1251_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1251_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1203_rfin/X}]
set_max_fanout 4  [get_pins {FE_PHC1203_rfin/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1069_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC1069_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1059_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC1059_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1056_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC1056_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC1054_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC1054_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC839_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC839_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC836_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC836_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC834_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC834_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC665_rst/X}]
set_max_fanout 4  [get_pins {FE_PHC665_rst/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC603_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC603_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC602_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC602_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC587_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC587_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC530_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC530_RX/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC335_MOSI/X}]
set_max_fanout 4  [get_pins {FE_PHC335_MOSI/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC334_SCK/X}]
set_max_fanout 4  [get_pins {FE_PHC334_SCK/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC325_CS/X}]
set_max_fanout 4  [get_pins {FE_PHC325_CS/X}]
set_max_capacitance 0.005  [get_pins {FE_PHC284_RX/X}]
set_max_fanout 4  [get_pins {FE_PHC284_RX/X}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {rfin}]
set_max_fanout 4  [get_ports {rfin}]
set_max_capacitance 0.005  [get_ports {rst}]
set_max_fanout 4  [get_ports {rst}]
set_max_capacitance 0.005  [get_ports {MOSI}]
set_max_fanout 4  [get_ports {MOSI}]
set_max_capacitance 0.005  [get_ports {CS}]
set_max_fanout 4  [get_ports {CS}]
set_max_capacitance 0.005  [get_ports {SCK}]
set_max_fanout 4  [get_ports {SCK}]
set_max_capacitance 0.005  [get_ports {TX_BY}]
set_max_fanout 4  [get_ports {TX_BY}]
set_max_capacitance 0.005  [get_ports {RX}]
set_max_fanout 4  [get_ports {RX}]
set_load -pin_load -max  0.004  [get_ports {pkt_rec}]
set_load -pin_load -min  0.004  [get_ports {pkt_rec}]
set_load -pin_load -max  0.004  [get_ports {MISO}]
set_load -pin_load -min  0.004  [get_ports {MISO}]
set_load -pin_load -max  0.004  [get_ports {TX_OUT}]
set_load -pin_load -min  0.004  [get_ports {TX_OUT}]
set_load -pin_load -max  0.004  [get_ports {sh_en}]
set_load -pin_load -min  0.004  [get_ports {sh_en}]
set_max_fanout 4  [get_designs {TOP}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {SCK}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {RX}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_BY}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {CS}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rfin}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MOSI}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MISO}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_OUT}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {pkt_rec}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sh_en}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
