#######################################################
#              
#  Innnovus PnR Flow File                                       
#  Created on Mon May 26 
#  Sergey Sokolovskiy
#  Columbia Universit- BIOEE           
#                                                     
#######################################################

#Set Process Node
setDesignMode -process 22

#Start by loading all tech information, verilog file and MMMC file
set TECH_LEF {/tech/gf/GF_22nm/PDK/22FDX-PLUS/V1.0_2.5/PlaceRoute/Innovus/Techfiles/10M_2Mx_5Cx_1Jx_2Qx_LB/22FDSOI_10M_2Mx_5Cx_1Jx_2Qx_LB_116cpp_tech.lef /tech/gf/GF_22nm/PDK/22FDX-PLUS/V1.0_2.5/PlaceRoute/Innovus/Techfiles/22fdsoi_standard_site.lef /tech/gf/GF_22nm/IP/synopsys/v-logic_gf22nspslogl24edl116f/DesignWare_logic_libs/globalfoundaries22nhsp/24hd116/edl/svt/3.00a/lef/5.8/gf22nspslogl24edl116f.lef}

set VERILOG_TOPLEVEL ../../dc/TOP/TOP.nl.v
#set VERILOG_SDC ../../dc/TOP/report/con.sdc

set GDS_MAPFILE 	/tech/gf/GF_22nm/PDK/22FDX-PLUS/V1.0_2.5/PlaceRoute/Innovus/Techfiles/10M_2Mx_5Cx_1Jx_2Qx_LB/22FDSOI_10M_2Mx_5Cx_1Jx_2Qx_LB_edi2gds_colored.layermap

set MMMC_FILE ../scripts/mmmc_setup.tcl


#Silince certain warnings
#antenna diffusion area warning
set_message -id IMPLF-200 -suppress 
set_message -id IMPLF-201 -suppress
#fill cell warning
#set_message -id TECHLIB-302 -suppress
#techsite mismatch warnign
set_message -id IMPFP-3961 -suppress
#scan chain ignore
set_message -id IMPSP-9025 -suppress


#Import the Design
setDesignMode -process 22
set init_gnd_net gnd
set init_lef_file $TECH_LEF
set init_design_settop 0
set init_verilog $VERILOG_TOPLEVEL
set init_mmmc_file $MMMC_FILE
set init_pwr_net vdd
init_design -setup view_slow_mission -hold view_fast_mission 



#Set Floorplanning
getIoFlowFlag
setIoFlowFlag 0
floorPlan -site GF22_DST -s 50 50 4 4 4 4 -flip s
uiSetTool select
getIoFlowFlag
fit
generateTracks

#Connect Global Nets
clearGlobalNets
globalNetConnect vdd -type pgpin -pin VDD -inst * -verbose
globalNetConnect gnd -type pgpin -pin VSS -inst * -verbose


#Create Power Rings and Horizontal Power Strips
addRing -nets {vdd gnd} -layer {top M1 bottom M1 left M2 right M2} -width 1.0 -spacing 0.4 -offset 0.4 

sroute -nets {vdd gnd}

saveDesign floorplan.inn

#------------------------------------------------------------
# Check timing (and generate timing graph for placement)
#------------------------------------------------------------
checkDesign -all
check_timing

timeDesign -preplace -prefix preplace_setup -outDir timingReports
timeDesign -preplace -hold -prefix preplace_hold -outDir timingReports 
#not sure abt this line, hold timing should bot be checked out in the pre place mode


#------------------------------------------------------------
# Placement and preCTS optimization
#------------------------------------------------------------
setPlaceMode -place_global_cong_effort high
setPlaceMode -place_global_clock_power_driven true
setPlaceMode -place_global_clock_power_driven_effort high
setPlaceMode -placeIOPins true -checkRoute true
setOptMode -reclaimArea true -effort high
place_opt_design

#------------------------------------------------------------
# Add hi/low ties, decap and boundary cells 
#------------------------------------------------------------
addTieHiLo -cell {UDB116SVT24_TIE0_ECOCT_1 UDB116SVT24_TIE1_ECOCT_1}
addDeCapCellCandidates UDB116SVT24_DCAP_ECOCT_16 16
addDeCapCellCandidates UDB116SVT24_DCAP_ECOCT_8 8  
addDeCapCellCandidates UDB116SVT24_DCAP_ECOCT_4 4
addDeCap -totCap 5000 

#------------------------------------------------------------
# Checks and reports
#------------------------------------------------------------
reportCongestion -overflow
timeDesign -preCTS -prefix preCTS_setup -outDir timingReports
timeDesign -preCTS -hold -prefix preCTS_hold -outDir timingReports

#------------------------------------------------------------
# Optimize for Power
#------------------------------------------------------------
setDesignMode -powerEffort high
setOptMode -leakageToDynamicRatio 0.5
optPower -preCTS
saveDesign preCTS.inn

#------------------------------------------------------------
# CTS and timing
#------------------------------------------------------------
setOptMode -holdTargetSlack 0.050
clock_opt_design
timeDesign -postCTS -hold -prefix postCTS_hold -outDir timingReports
optPower -postCTS
saveDesign postCTSopt.inn

#------------------------------------------------------------
# Routing Options
#------------------------------------------------------------
setNanoRouteMode -routeWithTimingDriven true 
setNanoRouteMode -routeWithSiDriven true 
setNanoRouteMode -drouteFixAntenna true
setNanoRouteMode -routeInsertAntennaDiode false
setNanoRouteMode -drouteUseMultiCutViaEffort medium
setNanoRouteMode -route_detail_end_iteration 150
#------------------------------------------------------------
# Routing, optimization and timing
#------------------------------------------------------------
routeDesign
setAnalysisMode -analysisType onChipVariation -cppr both 
setOptMode -fixHoldAllowSetupTnsDegrade false
optDesign -postRoute -setup -hold
timeDesign -postRoute -prefix postRoute_setup -outDir timingReports
timeDesign -postRoute -hold -prefix postRoute_hold -outDir timingReports



#------------------------------------------------------------
# Filler Cells
#-------------------s-----------------------------------------
setFillerMode -core {UDB116SVT24_FILL_ECOCT20 UDB116SVT24_FILL_ECOCT19 UDB116SVT24_FILL_ECOCT18 UDB116SVT24_FILL_ECOCT17 UDB116SVT24_FILL_ECOCT16 UDB116SVT24_FILL_ECOCT15 UDB116SVT24_FILL_ECOCT14 UDB116SVT24_FILL_ECOCT13 UDB116SVT24_FILL_ECOCT12 UDB116SVT24_FILL_ECOCT11 UDB116SVT24_FILL_ECOCT10 UDB116SVT24_FILL_ECOCT9 UDB116SVT24_FILL_ECOCT8 UDB116SVT24_FILL_ECOCT7 UDB116SVT24_FILL_ECOCT6 UDB116SVT24_FILL_ECOCT5 UDB116SVT24_FILL_ECOCT4 UDB116SVT24_FILL_ECOCT3 UDB116SVT24_FILL_ECOCT2 UDB116SVT24_FILL_ECOCT1}

addFiller

#------------------------------------------------------------
# Report
#------------------------------------------------------------
report_route
reportCongestion -overflow
reportPower -leakage -view slow -outfile power_setup_leakage_opt.rpt
reportPower -leakage -view fast -outfile power_hold_leakage_opt.rpt
reportPower -view slow -hierarchy all -outfile power_signoff.rpt
#signoffOptDesign -hold
#signoffTimeDesign -outDir signOffTimingReports

#============================================================
#Verification
#============================================================

verify_drc
verifyConnectivity
verifyACLimit
verifyProcessAntenna
checkRoute

#============================================================
# Write Outputs
#============================================================

# Write SDF timing
write_sdf ${VERILOG_TOPLEVEL}_par.sdf -version 3.0 -min_view view_fast_mission -max_view view_slow_mission -collapse_internal_pins

# Write out placed and routed verilog netlist for LVS
saveNetlist ${VERILOG_TOPLEVEL}_no_phys_inst.v -excludeLeafCell -includePowerGround
# Write verilog netlist without power and ground pins for each instance
saveNetlist ${VERILOG_TOPLEVEL}_no_pwr.v -excludeLeafCell
# Write out netlist (all components - power and physical only)
saveNetlist ${VERILOG_TOPLEVEL}_par.v -includePowerGround -excludeLeafCell -includePhysicalInst

# StreamOut
streamOut ${VERILOG_TOPLEVEL}_par.gds -mapFile ${GDS_MAPFILE}
# Save design
saveDesign signoff.inn




