###############################################################
#  Generated by:      Cadence Innovus 23.10-p003_1
#  OS:                Linux x86_64(Host ID linrack12.bioeelocal)
#  Generated on:      Thu Jun  5 07:35:57 2025
#  Design:            TOP
#  Command:           saveDesign postCTSopt
###############################################################
current_design TOP
create_clock [get_ports {clk}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {clk}]
set_clock_transition  -rise -min 0.06 [get_clocks {clk}]
set_clock_transition  -rise -max 0.06 [get_clocks {clk}]
set_clock_transition  -fall -min 0.06 [get_clocks {clk}]
set_clock_transition  -fall -max 0.06 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {rfin}]
set_max_fanout 4  [get_ports {rfin}]
set_max_capacitance 0.005  [get_ports {rst}]
set_max_fanout 4  [get_ports {rst}]
set_max_capacitance 0.005  [get_ports {MOSI}]
set_max_fanout 4  [get_ports {MOSI}]
set_max_capacitance 0.005  [get_ports {CS}]
set_max_fanout 4  [get_ports {CS}]
set_max_capacitance 0.005  [get_ports {SCK}]
set_max_fanout 4  [get_ports {SCK}]
set_max_capacitance 0.005  [get_ports {TX_BY}]
set_max_fanout 4  [get_ports {TX_BY}]
set_max_capacitance 0.005  [get_ports {RX}]
set_max_fanout 4  [get_ports {RX}]
set_max_capacitance 0.005  [get_ports {i_CONFIG}]
set_max_fanout 4  [get_ports {i_CONFIG}]
set_load -pin_load -max  0.004  [get_ports {osc_freq[1]}]
set_load -pin_load -min  0.004  [get_ports {osc_freq[1]}]
set_load -pin_load -max  0.004  [get_ports {osc_freq[0]}]
set_load -pin_load -min  0.004  [get_ports {osc_freq[0]}]
set_load -pin_load -max  0.004  [get_ports {arthur[3]}]
set_load -pin_load -min  0.004  [get_ports {arthur[3]}]
set_load -pin_load -max  0.004  [get_ports {arthur[2]}]
set_load -pin_load -min  0.004  [get_ports {arthur[2]}]
set_load -pin_load -max  0.004  [get_ports {arthur[1]}]
set_load -pin_load -min  0.004  [get_ports {arthur[1]}]
set_load -pin_load -max  0.004  [get_ports {arthur[0]}]
set_load -pin_load -min  0.004  [get_ports {arthur[0]}]
set_load -pin_load -max  0.004  [get_ports {pkt_rec}]
set_load -pin_load -min  0.004  [get_ports {pkt_rec}]
set_load -pin_load -max  0.004  [get_ports {MISO}]
set_load -pin_load -min  0.004  [get_ports {MISO}]
set_load -pin_load -max  0.004  [get_ports {TX_OUT}]
set_load -pin_load -min  0.004  [get_ports {TX_OUT}]
set_load -pin_load -max  0.004  [get_ports {sh_en}]
set_load -pin_load -min  0.004  [get_ports {sh_en}]
set_max_fanout 4  [get_designs {TOP}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {SCK}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {RX}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_BY}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {CS}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {i_CONFIG}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {rfin}]
set_input_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MOSI}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[1]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[2]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[0]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {MISO}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[3]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {osc_freq[0]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {arthur[1]}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {TX_OUT}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {pkt_rec}]
set_output_delay -add_delay 0.02 -clock [get_clocks {clk}] [get_ports {sh_en}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
